li012589/mulitTransistorChecker/STM32slave/User/I2C.h
#ifndef _I2C_H
#define _I2C_H

#include "stm32f10x.h"

#define OWN_ADDRESS               0x27                     //ATTENTION! the last bit not count!
#define SLAVE_ADDRESS             0x27                     //refer to the 7 bits i2c addressing

#define I2C_SPEED                 100000                   

/* I2C SPE mask */
#define CR1_PE_Set                ((uint16_t)0x0001)
#define CR1_PE_Reset              ((uint16_t)0xFFFE)

/* I2C START mask */
#define CR1_START_Set             ((uint16_t)0x0100)
#define CR1_START_Reset           ((uint16_t)0xFEFF)

#define CR1_POS_Set               ((uint16_t)0x0800)
#define CR1_POS_Reset             ((uint16_t)0xF7FF)

/* I2C STOP mask */
#define CR1_STOP_Set              ((uint16_t)0x0200)
#define CR1_STOP_Reset            ((uint16_t)0xFDFF)

/* I2C ACK mask */
#define CR1_ACK_Set               ((uint16_t)0x0400)
#define CR1_ACK_Reset             ((uint16_t)0xFBFF)

/* I2C ENARP mask */
#define CR1_ENARP_Set             ((uint16_t)0x0010)
#define CR1_ENARP_Reset           ((uint16_t)0xFFEF)

/* I2C NOSTRETCH mask */
#define CR1_NOSTRETCH_Set         ((uint16_t)0x0080)
#define CR1_NOSTRETCH_Reset       ((uint16_t)0xFF7F)

/* I2C registers Masks */
#define CR1_CLEAR_Mask            ((uint16_t)0xFBF5)

/* I2C DMAEN mask */
#define CR2_DMAEN_Set             ((uint16_t)0x0800)
#define CR2_DMAEN_Reset           ((uint16_t)0xF7FF)

/* I2C LAST mask */
#define CR2_LAST_Set              ((uint16_t)0x1000)
#define CR2_LAST_Reset            ((uint16_t)0xEFFF)

/* I2C FREQ mask */
#define CR2_FREQ_Reset            ((uint16_t)0xFFC0)

/* I2C ADD0 mask */
#define OAR1_ADD0_Set             ((uint16_t)0x0001)
#define OAR1_ADD0_Reset           ((uint16_t)0xFFFE)

/* I2C ENDUAL mask */
#define OAR2_ENDUAL_Set           ((uint16_t)0x0001)
#define OAR2_ENDUAL_Reset         ((uint16_t)0xFFFE)

/* I2C ADD2 mask */
#define OAR2_ADD2_Reset           ((uint16_t)0xFF01)

/* I2C F/S mask */
#define CCR_FS_Set                ((uint16_t)0x8000)

/* I2C CCR mask */
#define CCR_CCR_Set               ((uint16_t)0x0FFF)

/* I2C FLAG mask */
#define FLAG_Mask                 ((uint32_t)0x00FFFFFF)

/* I2C Interrupt Enable mask */
#define ITEN_Mask                 ((uint32_t)0x07000000)

#define I2C_IT_BUF                ((uint16_t)0x0400)
#define I2C_IT_EVT                ((uint16_t)0x0200)
#define I2C_IT_ERR                ((uint16_t)0x0100)

void I2C_Initializes(void);
void I2C_Master_BufferWrite(uint8_t* pBuffer, uint32_t NumByteToWrite, uint8_t SlaveAddress);
void NVIC_Configuration(void);

#endif
